{
  "movies": [
    {
      "id": "1",
      "name": "Inception",
      "genre": "Sci-Fi",
      "description": "Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.",
      "image": "pics/inception.jpg",
      "type": "movie"
    },
    {
      "id": "19",
      "name": "The Dark Knight Rises",
      "genre": "Action",
      "description": "It has been eight years since Batman (Christian Bale), in collusion with Commissioner Gordon (Gary Oldman), vanished into the night. Assuming responsibility for the death of Harvey Dent, Batman sacrificed everything for what he and Gordon hoped would be the greater good. However, the arrival of a cunning cat burglar (Anne Hathaway) and a merciless terrorist named Bane (Tom Hardy) force Batman out of exile and into a battle he may not be able to win.",
      "image": "pics/dn.jpg",
      "type": "movie"
    },
    {
      "id": "3",
      "name": "Blade Runner",
      "genre": "Sci-Fi",
      "description": "A blade runner Deckard (Harrison Ford) is forced by the police Boss (M. Emmet Walsh) to continue his old job as Replicant Hunter. His assignment: eliminate four escaped Replicants from the colonies who have returned to Earth. Before starting the job, Deckard goes to the Tyrell Corporation and he meets Rachel (Sean Young), a Replicant girl he falls in love with.",
      "image": "pics/BladeRunner.jpg",
      "type": "movie"
    },
    {
      "id": "4",
      "name": "Interstellar",
      "genre": "Sci-Fi",
      "description": "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
      "image": "pics/Interstellar.jpg",
      "type": "movie"
    },
    {
      "id": "5",
      "name": "Eternal Sunshine of the Spotless Mind",
      "genre": "Sci-Fi",
      "description": "After a painful breakup, Clementine (Kate Winslet) undergoes a procedure to erase memories of her former boyfriend Joel (Jim Carrey) from her mind. When Joel discovers that Clementine is going to extremes to forget their relationship, he undergoes the same procedure and slowly begins to forget the woman that he loved. Directed by former music video director Michel Gondry, the visually arresting film explores the intricacy of relationships and the pain of loss.",
      "image": "pics/eternal.jpg",
      "type": "movie"
    },
    {
      "id": "2",
      "name": "The Matrix",
      "genre": "Sci-Fi",
      "description": "Neo (Keanu Reeves) believes that Morpheus (Laurence Fishburne), an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity (Carrie-Anne Moss), a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.",
      "image": "pics/matrix.jpg",
      "type": "movie"
    },
    {
      "id": "6",
      "name": "The Terminator",
      "genre": "Sci-Fi",
      "description": "A cyborg is sent from the future to kill the mother of the future leader of mankind.",
      "image": "pics/terminator.jpg",
      "type": "movie"
    },
    {
      "id": "7",
      "name": "The Shawshank Redemption",
      "genre": "Drama",
      "description": "Disguised as a human, a cyborg assassin known as a Terminator (Arnold Schwarzenegger) travels from 2029 to 1984 to kill Sarah Connor (Linda Hamilton). Sent to protect Sarah is Kyle Reese (Michael Biehn), who divulges the coming of Skynet, an artificial intelligence system that will spark a nuclear holocaust. Sarah is targeted because Skynet knows that her unborn son will lead the fight against them. With the virtually unstoppable Terminator in hot pursuit, she and Kyle attempt to escape.",
      "image": "pics/shawshank.jpg",
      "type": "movie"
    },
    {
      "id": "8",
      "name": "Forrest Gump",
      "genre": "Drama",
      "description": "Slow-witted Forrest Gump (Tom Hanks) has never thought of himself as disadvantaged, and thanks to his supportive mother (Sally Field), he leads anything but a restricted life. Whether dominating on the gridiron as a college football star, fighting in Vietnam or captaining a shrimp boat, Forrest inspires people with his childlike optimism. But one person Forrest cares about most may be the most difficult to save -- his childhood love, the sweet but troubled Jenny (Robin Wright).",
      "image": "pics/forrest.jpg",
      "type": "movie"
    },
    {
      "id": "9",
      "name": "The Godfather",
      "genre": "Drama",
      "description": "Widely regarded as one of the greatest films of all time, this mob drama, based on Mario Puzo's novel of the same name, focuses on the powerful Italian-American crime family of Don Vito Corleone (Marlon Brando). When the don's youngest son, Michael (Al Pacino), reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal. Although Michael tries to maintain a normal relationship with his wife, Kay (Diane Keaton), he is drawn deeper into the family business.",
      "image": "pics/godfather.jpg",
      "type": "movie"
    },
    {
      "id": "10",
      "name": "Schindler's List",
      "genre": "Drama",
      "description": "Businessman Oskar Schindler (Liam Neeson) arrives in Krakow in 1939, ready to make his fortune from World War II, which has just started. After joining the Nazi party primarily for political expediency, he staffs his factory with Jewish workers for similarly pragmatic reasons. When the SS begins exterminating Jews in the Krakow ghetto, Schindler arranges to have his workers protected to keep his factory in operation, but soon realizes that in so doing, he is also saving innocent lives.",
      "image": "pics/list.jpg",
      "type": "movie"
    },
    {
      "id": "11",
      "name": "The Dark Knight",
      "genre": "Action",
      "description": "With the help of allies Lt. Jim Gordon (Gary Oldman) and DA Harvey Dent (Aaron Eckhart), Batman (Christian Bale) has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker (Heath Ledger) suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.",
      "image": "pics/batman.jpg",
      "type": "movie"
    },
    {
      "id": "12",
      "name": "Die Hard",
      "genre": "Action",
      "description": "A NYPD officer tries to save hostages from a German terrorist during a Christmas party.",
      "image": "pics/diehard.jpg",
      "type": "movie"
    },
    {
      "id": "13",
      "name": "Mad Max: Fury Road",
      "genre": "Action",
      "description": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler.",
      "image": "pics/mad.jpg",
      "type": "movie"
    },
    {
      "id": "14",
      "name": "Kill Bill: Volume 1",
      "genre": "Action",
      "description": "The Bride seeks revenge on her former associates who betrayed her.",
      "image": "pics/kill.jpg",
      "type": "movie"
    },
    {
      "id": "15",
      "name": "Pulp Fiction",
      "genre": "Crime",
      "description": "Interwoven stories of criminals in Los Angeles.",
      "image": "pics/pulp.jpg",
      "type": "movie"
    },
    {
      "id": "16",
      "name": "The Godfather: Part II",
      "genre": "Crime",
      "description": "The early life and career of Vito Corleone in 1920s New York.",
      "image": "pics/gf2.jpg",
      "type": "movie"
    },
    {
      "id": "17",
      "name": "Goodfellas",
      "genre": "Crime",
      "description": "The rise and fall of a mob associate.",
      "image": "pics/good.jpg",
      "type": "movie"
    },
    {
      "id": "18",
      "name": "Reservoir Dogs",
      "genre": "Crime",
      "description": "A botched jewelry heist leads to a tense standoff.",
      "image": "pics/dog.jpg",
      "type": "movie"
    },
    {
      "id": "20",
      "name": "John Wick",
      "genre": "Action",
      "description": "Legendary assassin John Wick (Keanu Reeves) retired from his violent career after marrying the love of his life. Her sudden death leaves John in deep mourning. When sadistic mobster Iosef Tarasov (Alfie Allen) and his thugs steal John's prized car and kill the puppy that was a last gift from his wife, John unleashes the remorseless killing machine within and seeks vengeance. Meanwhile, Iosef's father (Michael Nyqvist) -- John's former colleague -- puts a huge bounty on John's head.",
      "image": "pics/jw.jpg",
      "type": "movie"
    },
    {
      "id": "0195",
      "name": "life itself",
      "genre": "Drama",
      "description": "real life story",
      "type": "Movie",
      "image": ""
    },
    {
      "id": "faec",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "74c6",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "016d",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "26dd",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "8af2",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "5756",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    },
    {
      "id": "e57f",
      "name": "",
      "genre": "",
      "description": "",
      "type": "",
      "image": ""
    }
  ],
  "tvShow": [
    {
      "id": "21",
      "name": "Stranger Things",
      "genre": "Sci-Fi",
      "description": "Set in the 1980s, the series centers around the residents of the fictional small town of Hawkins, Indiana, as they are plagued by a hostile alternate dimension known as the Upside Down, after a nearby human experimentation facility opens a gateway between it and the normal world.",
      "image": "pics/stranger.jpg",
      "type": "tvShow"
    },
    {
      "id": "22",
      "name": "Breaking Bad",
      "genre": "Drama",
      "description": "Breaking Bad follows Walter White, a struggling, frustrated high school chemistry teacher who transforms into a ruthless kingpin in the local methamphetamine drug trade, driven to provide for his family financially after being diagnosed with inoperable lung cancer.",
      "image": "pics/bad.jpg",
      "type": "tvShow"
    },
    {
      "id": "23",
      "name": "Game of Thrones",
      "genre": "Fantasy",
      "description": "Premise and plot The planet on which Westeros is found has seasons of variable lengths, with summers and winters often lasting for many years. The series focuses on several noble houses of Westeros and a complicated, multiparty war for the Iron Throne that features shifting conflicts, alliances, and betrayals.",
      "image": "pics/got.jpg",
      "type": "tvShow"
    },
    {
      "id": "24",
      "name": "The 100",
      "genre": "Sci-Fi",
      "description": "A group of juvenile delinquents is sent back to Earth to see if it's habitable again.",
      "image": "pics/100.jpg",
      "type": "tvShow"
    },
    {
      "id": "25",
      "name": "Alice in Borderland",
      "genre": "Sci-Fi",
      "description": " An aimless gamer and his two friends find themselves in a parallel Tokyo, where they're forced to compete in a series of sadistic games to survive. It covers the Borderland Games' first phase with the arrival of the players and the completion of the Spot Card Games.",
      "image": "pics/alice.webp",
      "type": "tvShow"
    },
    {
      "id": "26",
      "name": "Vikings",
      "genre": "Drama",
      "description": "It broadly follows the exploits of the legendary Viking chieftain Ragnar Lothbrok and his crew, family and descendants, as notably laid down in the 13th-century sagas Ragnars saga Loðbrókar and Ragnarssona þáttr, as well as in Saxo Grammaticus' 12th-century work Gesta Danorum.",
      "image": "pics/vikings.jpg",
      "type": "tvShow"
    },
    {
      "id": "27",
      "name": "The Last Kingdom",
      "genre": "Drama",
      "description": "The Last Kingdom follows the journey of Uhtred, a young nobleman raised by Vikings in 9th-century England. It is a thrilling historical fiction that depicts the clash between the Vikings and the Saxons. Uhtred must navigate between his Viking upbringing and his loyalty to the kingdom of Wessex, torn between two worlds.",
      "image": "pics/utred.jpg",
      "type": "tvShow"
    },
    {
      "id": "28",
      "name": "1899",
      "genre": "Drama",
      "description": "Passengers on a migrant ship discover mysterious events as they journey to the U.S.",
      "image": "pics/1899.jpg",
      "type": "tvShow"
    },
    {
      "id": "29",
      "name": "Dark",
      "genre": "Sci-Fi",
      "description": "A German science fiction thriller involving time travel and complex family relationships.",
      "image": "pics/dark.jpg",
      "type": "tvShow"
    },
    {
      "id": "30",
      "name": "Lucifer",
      "genre": "Crime",
      "description": "The Devil decides to take a vacation from Hell and lives in Los Angeles.Lucifer is the devil but abandons Hell to run a nightclub in Los Angeles, subsequently experiencing massive life changes when he becomes a consultant to the Los Angeles Police Department. The supporting cast includes Lauren German, Kevin Alejandro, D. B.",
      "image": "pics/lucifer.jpg",
      "type": "tvShow"
    }
  ]
}